# PANDAS

## pandas Series

In [44]:
import pandas as pd

In [65]:
ser = pd.Series(data = [100, 200, 300, 400, 500], index = ['tom','bob','nancy','eric','das'] )

In [66]:
ser

tom      100
bob      200
nancy    300
eric     400
das      500
dtype: int64

In [68]:
ser = pd.Series([100, 200, 300, 400, 500],['tom','bob','nancy','eric','das'] )

In [69]:
ser

tom      100
bob      200
nancy    300
eric     400
das      500
dtype: int64

In [70]:
ser.index

Index(['tom', 'bob', 'nancy', 'eric', 'das'], dtype='object')

In [71]:
ser = pd.Series([100, 200, 'food', 400, 'bar'],['tom','bob','nancy','eric','das'] )

In [72]:
ser

tom       100
bob       200
nancy    food
eric      400
das       bar
dtype: object

In [73]:
ser['nancy']

'food'

In [74]:
ser.loc['nancy']

'food'

In [75]:
ser.loc[['nancy','bob']]

nancy    food
bob       200
dtype: object

In [76]:
ser[[4,3,1]]

das     bar
eric    400
bob     200
dtype: object

In [77]:
ser.iloc[[2]]

nancy    food
dtype: object

In [78]:
'bob' in ser

True

In [79]:
ser

tom       100
bob       200
nancy    food
eric      400
das       bar
dtype: object

In [80]:
ser * 2

tom           200
bob           400
nancy    foodfood
eric          800
das        barbar
dtype: object

In [81]:
ser[['tom','bob']] ** 2

tom    10000
bob    40000
dtype: object

## pandas DataFrame

**Create Data Fram**

In [83]:
d = {'one': pd.Series([100.,200.,300.],['apple','ball','clock']),
    'two' : pd.Series([111.,222.,333.,444.,],['apple','ball','cerill','dancy'])}

In [84]:
df = pd.DataFrame(d)

In [85]:
df

          one    two
apple   100.0  111.0
ball    200.0  222.0
cerill    NaN  333.0
clock   300.0    NaN
dancy     NaN  444.0

In [86]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [88]:
df.columns

Index(['one', 'two'], dtype='object')

In [89]:
pd.DataFrame(d, index = ['dancy', 'ball','apple'])

         one    two
dancy    NaN  444.0
ball   200.0  222.0
apple  100.0  111.0

In [90]:
pd.DataFrame(d, index = ['dancy', 'ball', 'apple'], columns = ['two','five'])

         two five
dancy  444.0  NaN
ball   222.0  NaN
apple  111.0  NaN

**Create DataFrame from list of Python Dictionaries**

In [93]:
data = [{'alex':1, "joe": 2},{"emma":5, "dora": 10, "alice":20}]

In [94]:
pd.DataFrame(data)

   alex  alice  dora  emma  joe
0   1.0    NaN   NaN   NaN  2.0
1   NaN   20.0  10.0   5.0  NaN

In [95]:
pd.DataFrame(data, index=['orange','red'])

        alex  alice  dora  emma  joe
orange   1.0    NaN   NaN   NaN  2.0
red      NaN   20.0  10.0   5.0  NaN

**Basic DataFrame operations**

In [97]:
df

          one    two
apple   100.0  111.0
ball    200.0  222.0
cerill    NaN  333.0
clock   300.0    NaN
dancy     NaN  444.0

In [99]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [100]:
df['three'] = df['one'] + df['two']

In [101]:
df

          one    two  three
apple   100.0  111.0  211.0
ball    200.0  222.0  422.0
cerill    NaN  333.0    NaN
clock   300.0    NaN    NaN
dancy     NaN  444.0    NaN

In [102]:
df['flag'] = df['one'] > 250

In [103]:
df

          one    two  three   flag
apple   100.0  111.0  211.0  False
ball    200.0  222.0  422.0  False
cerill    NaN  333.0    NaN  False
clock   300.0    NaN    NaN   True
dancy     NaN  444.0    NaN  False

In [104]:
three = df.pop('three')
three

apple     211.0
ball      422.0
cerill      NaN
clock       NaN
dancy       NaN
Name: three, dtype: float64

In [105]:
df

          one    two   flag
apple   100.0  111.0  False
ball    200.0  222.0  False
cerill    NaN  333.0  False
clock   300.0    NaN   True
dancy     NaN  444.0  False

In [ ]:
del df['two'[]]